# 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.

# 1+1+1+1
# 1+1+2
# 1+2+1
# 2+1+1
# 2+2
# 1+3
# 3+1
# 정수 n이 주어졌을 때, n을 1, 2, 3의 합으로 나타내는 방법의 수를 구하는 프로그램을 작성하시오.

# 첫째 줄에 테스트 케이스의 개수 T가 주어진다. 
# 각 테스트 케이스는 한 줄로 이루어져 있고, 정수 n이 주어진다. n은 양수이며 11보다 작다.

# 순서에 따라 다른 경우의 수가 된다. (1+1+2, 1+2+1, 2+1+1)이 다르다.
# 점화식 : dp[n] = dp[n-1]+dp[n-2]+dp[n-3]
# 2는 2와 1+1, 3은 3과 2의 경우의 수에서 1을 더한 방법 (2+1, 1+1+1)을 추가할 수 있다.
# 4는 3의 경우의 수에서 +1, 2의 경우의 수에서 +2
# 5는 4의 경우의 수에서 +1, 3의 경우의 수에서 +2, 2의 경우의 수에서 +1 

T = int(input())
nums =[]
for i in range(T):
    nums.append(int(input()))
dp=[1,2,4] # 1, 2, 3을 나타낼 수 있는 경우의 수

for i in range(3,max(nums)):
    dp.append(dp[i-1]+dp[i-2]+dp[i-3])

for i in nums:
    print(dp[i-1])