# 구현
# 풀이를 떠올리는 것은 쉽지만 소스코드로 옮기기 어려운 문제

# 알고리즘은 간단한데 코드가 지나칠 만큼 길어지는 문제
# 실수 연산을 다루고, 특정 소수점 자리까지 출력해야 하는 문제
# 문자열을 특정한 기준에 따라서 끊어 처리해야 하는 문제
# 적절한 라이브러리를 찾아서 사용해야 하는 문제

# 행렬
for i in range(5):
    for j in range(5):
        print('(',i,',',j,')', end=' ')
    print()

# 시뮬레이션 및 완전탐색 문제에서는 방향벡터가 자주 활용
# 동, 북, 서, 남
dx = [0, -1, 0, 1]
dy = [1, 0, -1, 0]

# 현재 위치
x, y = 2, 2

for i in range(4):
    # 다음 위치
    nx = x + dx[i]
    ny = y + dy[i]
    print(nx, ny)

# 상하좌우 문제
# 여행가 보물 찾기
# 시작좌표는 (1,1) L,R,U,D 문자가 적혀있고 이걸로 움직임
# 공간을 벗어나는 움직임은 무시됨.
